/* A waiting message that indicates the app is communicating with the server */
"creating_mobilepay" = "Creating secure MobilePay transaction";

/* An error message indicating there was an unexpected error with the payment */
"payment_error_retry_later" = "Could not complete the payment due to an error. Please try again after a short time";

/* A success message indicating that the payment was completed and the payment session will end */
"payment_completed" = "Payment completed";

/* Indicates that the user wants to cancel the payment session and go back to the checkout */
"cancel" = "cancel";

/* No comment provided by engineer. */
"or" = "or";

/* indicates that the payment resulted in error, cancelled by the customer or declined by the provider */
"payment_rejected" = "Payment failed";

/* Indicates that the user wants to continue the payment session and try another payment */
"try_again" = "try again?";

/* A waiting message that indicates the app is communicating with the server */
"secure_connection" = "Establishing secure connection";

/* A waiting message indicating that the customer should complete the payment in the Swish app */
"completing_payment" = "Completing payment";

/* A waiting message that indicates that the app is communicating with the server */
"creating_swish" = "Creating secure Swish transaction";

/* A waiting message that indicates that the app is communicating with the server */
"creating_paypal" = "Creating secure PayPal transaction";

/* A waiting message that indicates that the app is communicating with the server */
"creating_paypal" = "Creating secure Trustly transaction";

/* A waiting message indicating that a new QR code image is being generated */
"generate_qr" = "Generating QR code";

/* Indicates that this app is prompting the user to open the Swish app in the same device */
"opening_swish" = "Opening the swish app";

/* A waiting message indicating that the customer should open the Swish app in another phone */
"pay_with_swish" = "You can pay with the Swish app now";

/* A button label that indicates the customer wants to pay getting a notification in another device */
"enter_phone" = "Enter phone number";

/* A button label that indicates the customer wants to pay with the Swish app in the same device */
"open_swish" = "Open Swish App";

/* No comment provided by engineer. */
"pay_another_phone" = "or pay using another phone";

/* A button label that indicates the customer wants to pay by scanning a QR code in another device */
"scan_qr_code" = "Scan QR Code";

/* The caption for a QR code image prompting the user to scan it with another device */
"scan_with_swish" = "Scan this code with the Swish app";

/* Call to action after entering the Swish phone number to make a payment */
"pay_now" = "Pay Now";

/* A waiting message that indicates the app is communicating with the server */
"creating_vipps" = "Creating secure Vipps transaction";

/* A waiting message that indicates the app is finilizing the payment */
"waiting_for_payment" = "Completing your payment, please wait";

/* Alert message to ask the user if they want to cancel the payment */
"cancel_payment" = "Cancel Payment?";

/* Continue in the same payment session */
"continue" = "Continue";

/* Abort the payment */
"confirm_cancellation" = "Yes, cancel";

/* A waiting message that indicates the app is communicating with the server */
"creating_secure_transaction" = "Creating secure transaction";

/* Indicates that Apple Pay is not available on this device */
"apple_pay_not_available" = "Apple Pay is not available on this device";

/* Tells the customer that the payment is taking longer than usual but is still being processed */
"payment_taking_longer" = "The payment is taking longer than usual. Hang tight — we're still processing it";
